"""1. Создать Телеграм-бота. Создать таблицу, в которую при обращении к Телеграм-боту будет сохраняться следующая
информация:
- nickname пользователя;
- идентификатор чата, через которое происходит общение;
- дата и время получения сообщения

2. Создать новую модель "Клиенты" (Customers), в которой предусмотреть на своё усмотрение необходимые поля, ограничения
и связи. Обязательным будет наличие в вашей модели поля is_subscribed (для подписки на уведомления).

Данная модель будет ответственна за работу с информацией о пользователях, которые оставляют заявки на консультацию
или ремонт. Подумайте над тем, какие дополнения потребует ваша модель Orders и внесите их.
"""
