"""1. 
+    - Создать свой собственный репозиторий. При создании указать наличие файла Readme и gitignore для Python.
+    - создать ветки согласно домашним заданиям по урокам
+    - в папках создать файлы homework и добавить туда домашние задания согласно урокам
+    - сделать коммит и пуш
+    - поставить pull-request в github
+    - поделиться с товарищами PR, посмотреть чужие PR, оставить комментарии при необходимости
+    - сделать merge, обновить главную ветку с помощью команды pull на локальном компьютере"""